#coding:utf-8
JOB_PROF = [[
[2,'计算机软件'],
[3,'计算机硬件'],
[4,'计算机服务(系统、数据服务，维修)'],
[5,'通信/电信/网络设备'],
[6,'通信/电信运营、增值服务'],
[7,'互联网/电子商务'],
[8,'网络游戏'],
[9,'电子技术/半导体/集成电路'],
[10,'仪器仪表/工业自动化'],],[
[12,'会计/审计'],
[13,'金融/投资/证券'],
[14,'银行'],
[15,'保险'],],[
[17,'贸易/进出口'],
[18,'批发/零售'],
[20,'服装/纺织/皮革'],
[21,'家具/家电/工艺品/玩具/珠宝'],
[22,'办公用品及设备'],
[23,'机械/设备/重工'],
[24,'汽车及零配件'],],[
[26,'制药/生物工程'],
[27,'医疗/护理/保健/卫生'],
[28,'医疗设备/器械'],
[30,'广告'],
[31,'公关/市场推广/会展'],
[32,'影视/媒体/艺术'],
[33,'文字媒体/出版'],
[34,'印刷/包装/造纸'],],[
[36,'房地产开发'],
[37,'建筑/建材/工程'],
[38,'家居/室内设计/装潢'],
[39,'物业管理/商业中心'],],[
[41,'中介服务'],
[42,'专业服务(咨询，人力资源)'],
[43,'外包服务'],
[44,'检测，认证'],
[45,'法律'],
[46,'教育/培训'],
[47,'学术/科研'],],[
[49,'餐饮业'],
[50,'酒店/旅游'],
[51,'娱乐/休闲/体育'],
[52,'美容/保健'],
[53,'生活服务'],],[
[55,'交通/运输/物流'],
[56,'航天/航空'],],[
[58,'石油/化工/矿产/地质'],
[59,'采掘业/冶炼'],
[60,'电力/水利'],
[61,'原材料和加工'],],[
[63,'政府'],
[64,'非盈利机构'],
[65,'环保'],],[
[66,'农业/渔业/林业'],
[67,'多元化业务集团公司'],
[68,'其他行业'],
]]

if __name__ == "__main__":
    new_prof = []
    for b,i in enumerate(JOB_PROF):
        m =b*100
        km = []
        for j,k in enumerate(i):
            km.append([j+m,k[1]])
        new_prof.append(km)
    from pprint import pformat
    print pformat(new_prof)
